app/controllers/api/feeds_controller.rb

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://www.reddit.com/.rss' LIMIT 1
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 4]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy!